# Програма для обчислення n-го числа Фібоначчі.

# функція для обчислення чисел Фібоначчі реалізована за допомогою рекурсії
# перший якщо n менше або рівне за 1, то повертаємо n
# якщо n є більшим, то повертаємо суму двох функцій fibonacci від n - 1 та n - 2
# таким чином творячи рекурсію - виклик функції у свому тілі самої себе 


# Ви маєте зреалізувати логіку для обчислення n-го члена послідовності Фібоначчі.

#class Calculator
  def fibonacci n
   n = n.to_i
   if (n<=1)
     return n
   else
     a = fibonacci(n - 1) + fibonacci(n - 2)
	return a
   end
end
puts "Enter n"
n = gets.chomp
puts fibonacci n