# Даний модуль діє, як простір імен.
# Суттю цього завдання є написання модулю, який має функції
# для статистичного аналізу рядків.
# 
# Він має містити такі функції
# 1. length - функція, яка обраховує довжину вхідного рядка
#     та виводить результат у спеціальному форматі
# 2. most_frequent - функція, яка знаходить символ, який найчастіше зустрічається
#     у рядку та виводить у спеціальному форматі його та кількість його зустрічей.
# 3. char_stats - фукнція, яка повертає масив у вигляді символ-'кількість зустрічей'.
#     масив відсортований за спаданням кількості зустрічей символів у рядку аргументі.

# Ви маєте дописати код для правильної роботи методів ( length, most_frequent, char_stats ) нищевказаного модулю.

module Stats

# тут слід додати через інтерполяцію довжину вхідного рядку
def len str
  
  "Довжина рядка складає #{str.length} символів."
end

# тут слід використати функцію chars_stats, і у відповідні місця вставити ключ та значення
# символу, який найбільше зустрічаєтсья

def most_frequent str 
  char_stats.first 
end

# дана функція обраховує кількість зустрічей символів у рядку.
# в результаті ми маємо отримати масив
def char_stats 
  # створюємо хеш, в який будемо записувати пари 'символ' => 'кількість його зустрічей'
  elements = @text.upcase.gsub!(/\W+/, '').each_char.with_object(Hash.new(0)) { |key, elements| elements[key] += 1 }
  elements.sort_by{ |key, elements| elements }.reverse 

end 
end 
class Init
 include Stats
  def initialize(t)
    @text = t
  end
end 
 puts "Enter string"
  a = gets.chomp
  a =Init.new (a)
  a.char_stats
  # використовуємо ітератор, який передає блоку символ
  
    # тут ми маємо перевірити, чи символ вже є у хеші
    # це ми можемо зробити за допомогою методу include?
    # він повертає чи є його аргумент ключем у хеші.
    

  # тут ми маємо перетворити хеш у масив за допомогою методу to_a
  # останнім кроком є сортування отриманого двовимірного масиву ( кожен елемент масиву є масивом )
  # за допомогою методу sort(). В цей метод можна передати блок, який визначає логіку порівняння.
  # Наприклад [1,2,3,4,5].sort {|a,b| b <=> a} поверне масив [5,4,3,2,1].
 
